'use strict'

//1. Напишіть цикл for, який виведе числа від 1 до 10 в консоль.
// for(let i = 0; i <= 10; i++){
//     console.log(i);
// }

//2. Напишіть цикл while, який виведе числа від 10 до 1 в консоль.
// let i = 10;
// while(i >= 1){
//     console.log(i);
//     i--;
// }

//3. Напишіть цикл for, який виведе парні числа від 2 до 10 в консоль.
// for(let i = 2; i <= 10; i++){
//     if(i % 2 !== 0) continue;
//     console.log(i);
// }

//4. Напишіть цикл while, який виведе суму чисел від 1 до 100.
// let i = 1;
// let sum = 0;
// while(i <= 100){
//     sum += i;
//     i++
// }
// console.log(sum);

//5. Напишіть цикл while, який виведе всі числа, кратні 3, від 3 до 30 в консоль.
// let i = 3;
// while(i <= 30){
//     if(i % 3 === 0) console.log(i);
//     i++
// }

//6. Напишіть цикл for, який виведе таблицю множення числа, введеного користувачем (від 1 до 10) в консоль. (Наприклад, 5 * 1 = 5, 5 * 2 = 10 і т.д.)
// let multiplication = +prompt('Введіть число:');
// for(let i = 1; i <= 10; i++){
//     console.log(`${multiplication} * ${i} = ${multiplication*i}`);
// }

//7. Напишіть цикл while, який знайде суму всіх чисел, кратних 5 або 7, від 1 до 1000.
// let i = 1;
// let sum = 0;
// while(i <= 100){
//     if(i % 5 === 0 || i % 7 === 0) sum += i;  
//     i++;
// }
// console.log(sum);

//8. Напишіть цикл for, який обчислить факторіал числа, яке ввів користувач.
// let num = +prompt('Введіть число:');
// let fact = 1;
// for(let i = 1; i <= num; i++){
//     console.log(`!${i} = ${fact *= i}`);
// }

// //9.* Напишіть цикл while, який виведе всі прості числа від 2 до 20 в консоль.
// let i = 2;
// while(i <= 20){
//     if(i % 1 === 0 && i % i === 0) console.log(i);
//     i++;
// }

//задачі зі статті

//Виведіть парні числа від 2 до 10, використовуючи цикл for.
// for(let i = 2; i <= 10; i++){
//     if(i % 2 === 0) console.log(i);
// }

//Замініть цикл for на while так, щоб поведінка не змінилася (щоб вивід залишився той самий).
// for (let i = 0; i < 3; i++) {
//     alert( `число ${i}!` );
// }

// let i = 0;
// while(i < 3){
//     alert(`число ${i}!`)
//     i++;
// }
